'''1021번 회전하는 큐
문제
지민이는 N개의 원소를 포함하고 있는 양방향 순환 큐를 가지고 있다. 지민이는 이 큐에서 몇 개의 원소를 뽑아내려고 한다.
지민이는 이 큐에서 다음과 같은 3가지 연산을 수행할 수 있다.

1. 첫 번째 원소 popleft / 원래 큐의 원소가 a1, ..., ak이었던 것이 a2, ..., ak와 같이 된다.
2. 왼쪽으로 한 칸씩 rotate(-1) / a1, ..., ak가 a2, ..., ak, a1이 된다.
3. 오른쪽으로 한 칸씩 rotate(1) / a1, ..., ak가 ak, a1, ..., ak-1이 된다.

큐에 처음에 포함되어 있던 수 N이 주어진다. 그리고 지민이가 뽑아내려고 하는 원소의 위치가 주어진다. (이 위치는 가장 처음 큐에서의 위치이다.) 이때, 그 원소를 주어진 순서대로 뽑아내는데 드는 2번, 3번 연산의 최솟값을 출력하는 프로그램을 작성하시오.

입력
첫째 줄에 큐의 크기 N과 뽑아내려고 하는 수의 개수 M이 주어진다. N은 50보다 작거나 같은 자연수이고, M은 N보다 작거나 같은 자연수이다. 둘째 줄에는 지민이가 뽑아내려고 하는 수의 위치가 순서대로 주어진다. 위치는 1보다 크거나 같고, N보다 작거나 같은 자연수이다.'''
'''
10 3
1 2 3
>> 0
10 3
2 9 5
>> 58'''

# 길이 10 에서 2, 9, 5 숫자가 맨 앞으로 오기 전까지 가장 많이 2, 3번 과정을 겪은 숫자들을 모아서 가장 작은 수를 출력한다.

# 2: 0
# 9: 12회
# 5: 8회

# [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]   -1      1번만 실행해도 2번이 출력됨 -> 0
# [3, 4, 5, 6, 7, 8, 9, 10, 2] cnt = 1
# [2, 3, 4, 5, 6, 7, 8, 9, 10] cnt = 2

# [3, 4, 5, 6, 7, 8, 9, 10]         -2
# [4, 5, 6, 7, 8, 9, 10, 3] cnt = 3
# [3, 4, 5, 6, 7, 8, 9, 10] cnt = 4

# [4, 5, 6, 7, 8, 9, 10]            -3
# [5, 6, 7, 8, 9, 10, 4] cnt = 5
# [4, 5, 6, 7, 8, 9, 10] cnt = 6

# [5, 6, 7, 8, 9, 10]               -4
# [6, 7, 8, 9, 10, 5] cnt = 7
# [5, 6, 7, 8, 9, 10] cnt = 8

# [6, 7, 8, 9, 10]                  -5
# [7, 8, 9, 10, 6] cnt = 9
# [6, 7, 8, 9, 10] cnt = 10

# [7, 8, 9, 10]                     -6
# [8, 9, 10, 7] cnt = 11
# [7, 8, 9, 10] cnt = 12

# [8, 9, 10]                        -7
# [9, 10, 8] cnt = 13
# [8, 9, 10] cnt = 14

# [9, 10]                           -8
# [10, 9] cnt = 15
# [9, 10] cnt = 16

# [10]                              -9

import sys
from collections import deque
sys.stdin = open("input.txt", "r")

N, M = map(int,input().split())
Q = deque()
print(N, M)